# -*- coding: utf-8 -*-
from __future__ import unicode_literals
# 练习:
#   已经有列表:
#     L = [3, 5]
#   用索引和切片操作,将原列表改变为:
#     L = [1, 2, 3, 4, 5, 6]
#   将列表反转,结果如下:
#     L = [6, 5, 4, 3, 2, 1]
#   然后删除最后一个元素,结果如下 :
#     L = [6, 5, 4, 3, 2]

L = [3, 5]
# 用索引和切片操作,将原列表改变为:
L += [6]  # L[2:2] = [6]
L[1:1] = [4]
L[0:0] = [1, 2]
print("L =", L)  # L = [1, 2, 3, 4, 5, 6]

# 将列表反转,结果如下:
L = L[::-1]
print("L =", L)  # L = [6, 5, 4, 3, 2, 1]
# 然后删除最后一个元素,结果如下 :
del L[-1]
print("L=", L)  # L = [6, 5, 4, 3, 2]
