#   1. 有一些数存于列表中,如:
#     L = [1, 3, 2, 1, 6, 4, 2, ..... 98, 82]
#     1) 将列表中出现的数字存入到另一个列表L2中
#       要求:
#         重复出现多次的数字只能在L2中保留一份(去重)
#     2)  将列表中出现两次的数字存于L3列表中,在L3列表中
#        只保留一份


L = [1, 3, 2, 1, 6, 4, 2, 98, 82]
L2 = []  # 用于不重复的数据
for x in L:  # 遍历
    # 如果x在L2中不存在,将x放入到L2中
    if x not in L2:
        L2.append(x)
print("L2 = ", L2)


# 2)  将列表中出现两次的数字存于L3列表中,在L3列表中
#    只保留一份
print("第二步:")
L3 = []
for x in L:
    # x不在L3里, 同时 x在L中存在的个数为2
    if x not in L3 and L.count(x) == 2:
        L3.append(x)
print("L3=", L3)

